InformationRegisters/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытияЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособЗачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачисленияВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БанковскиеСчетаФизическихЛиц</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеКартыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОткрытияЛицевыхСчетовСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеЗачисленияЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>АПК:58 физлицо является сотрудником</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗарплатныйПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗарплатныеПроекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыЗачисленияВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыЗачисленияВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЛицевомуСчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНомеруКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНомеруТелефона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНомеруСчетаВБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		
		Если Не Параметры.ЗначениеКопирования.Пустой() Тогда
			Запись.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
			Запись.НомерЛицевогоСчета = "";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.Организация)
			И ЗначениеЗаполнено(Запись.ЗарплатныйПроект) Тогда
			
			Запись.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ЗарплатныйПроект, "Организация");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ДатаОткрытияЛицевогоСчета) Тогда
			Запись.ДатаОткрытияЛицевогоСчета = ТекущаяДатаСеанса();
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Истина);
		
	КонецЕсли;
	
	СменитьФорматФайла();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	ОчиститьДокументОснование();
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОчиститьДокументОснование();
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныйПроектПриИзменении(Элемент)
	
	ОчиститьДокументОснование();
	СменитьФорматФайла();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЛицевогоСчетаПриИзменении(Элемент)
	
	ОчиститьДокументОснование();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы(Форма, ТолькоПросмотрЗаполненных)
	
	Элементы = Форма.Элементы;
	Запись = Форма.Запись;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФизическоеЛицо",
		"ТолькоПросмотр",
		ТолькоПросмотрЗаполненных И ЗначениеЗаполнено(Запись.ФизическоеЛицо));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Организация",
		"ТолькоПросмотр",
		ТолькоПросмотрЗаполненных И ЗначениеЗаполнено(Запись.Организация));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗарплатныйПроект",
		"ТолькоПросмотр",
		ТолькоПросмотрЗаполненных И ЗначениеЗаполнено(Запись.ЗарплатныйПроект)
			Или Не ЗначениеЗаполнено(Запись.Организация));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НомерЛицевогоСчета",
		"ТолькоПросмотр",
		Не ЗначениеЗаполнено(Запись.ЗарплатныйПроект)
			Или Не ЗначениеЗаполнено(Запись.ФизическоеЛицо));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДатаОткрытияЛицевогоСчета",
		"ТолькоПросмотр",
		Не ЗначениеЗаполнено(Запись.ЗарплатныйПроект)
			Или Не ЗначениеЗаполнено(Запись.ФизическоеЛицо));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДокументОснование",
		"Видимость",
		ЗначениеЗаполнено(Запись.ДокументОснование));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДокументОснование",
		"Видимость",
		ЗначениеЗаполнено(Запись.ДокументОснование));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;
	Запись = Форма.Запись;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СпособЗачисления",
		"Видимость",
		Форма.ЗарплатныйПроектПоддерживаетСпособыЗачисленияВыплат);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"БанковскийСчет",
		"Видимость",
		Форма.ПоддерживаетсяЗачислениеПоНомеруСчета);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"БанковскаяКарта",
		"Видимость",
		Форма.ПоддерживаетсяЗачислениеНаКарту);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Телефон",
		"Видимость",
		Форма.ПоддерживаетсяЗачислениеПоНомеруТелефона);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДокументОснование()
	
	Запись.ДокументОснование = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура СменитьФорматФайла()
	
	ЗарплатныйПроектПоддерживаетСпособыЗачисленияВыплат = 
		ОбменСБанкамиПоЗарплатнымПроектам.ЗарплатныйПроектПоддерживаетСпособыЗачисленияВыплат(Запись.ЗарплатныйПроект);
		
	ОбменСБанкамиПоЗарплатнымПроектам.ЗаполнитьСписокСпособовЗачисления(Элементы.СпособЗачисления, Запись.ЗарплатныйПроект);
	
	Для Каждого СпособЗачисления Из Элементы.СпособЗачисления.СписокВыбора Цикл
		
		Если СпособЗачисления.Значение = Перечисления.СпособыЗачисленияВыплат.ПоНомеруКарты Тогда
			ПоддерживаетсяЗачислениеНаКарту = Истина;
		ИначеЕсли СпособЗачисления.Значение = Перечисления.СпособыЗачисленияВыплат.ПоНомеруСчетаВБанк Тогда
			ПоддерживаетсяЗачислениеПоНомеруСчета = Истина;
		ИначеЕсли СпособЗачисления.Значение = Перечисления.СпособыЗачисленияВыплат.ПоНомеруТелефона Тогда
			ПоддерживаетсяЗачислениеПоНомеруТелефона	= Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗарплатныйПроектПоддерживаетСпособыЗачисленияВыплат Тогда
		Запись.СпособЗачисления = Перечисления.СпособыЗачисленияВыплат.ПоЛицевомуСчету;
		Запись.БанковскийСчет = Неопределено;
		Запись.БанковскаяКарта = Неопределено;
		Запись.Телефон = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
